# Parameter Type Id Array Label Property

Source: https://www.revitapidocs.com/2026/2affb7b3-c153-13e3-4535-8db99d64d458.htm

---

| Parameter Type Id Array Label Property |
| --- |

"Label"
**Namespace:** Autodesk.Revit.DB
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public static ForgeTypeId ArrayLabel { get; }
```

```
Public Shared ReadOnly Property ArrayLabel As ForgeTypeId
	Get
```

```
public:
static property ForgeTypeId^ ArrayLabel {
	ForgeTypeId^ get ();
}
```

```
static member ArrayLabel : ForgeTypeId with get
```

#### Property Value

ForgeTypeId See Also

#### Reference

ParameterTypeId Class Autodesk.Revit.DB Namespace